ore_icon = {
    "железо": "⛓",
    "золото": "🌕",
    "алмаз": "💎",
    "аметист": "🎆",
    "аквамарин": "💠",
    "изумруд": "🍀",
    "материя": "🌌",
    "плазма": "💥",
    "никель": "🪙",
    "титан": "⚙️",
    "кобальт": "🧪",
    "эктоплазма": "☄️",
    "палладий": "⚗️",
}

experience_ranges = {
    "железо": (1, 10),
    "золото": (10, 20),
    "алмаз": (20, 30),
    "аметист": (30, 50),
    "аквамарин": (50, 70),
    "изумруд": (70, 100),
    "материя": (100, 150),
    "плазма": (150, 200),
    "никель": (200, 300),
    "титан": (300, 500),
    "кобальт": (500, 800),
    "эктоплазма": (800, 1000),
    "палладий": (1000, 1500),
}

